ShsKiosk/Connected Services/ServiceReference1/UCWSTokenP1.wsdl

<?xml version="1.0" encoding="utf-8"?>
<definitions xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:tns="http://tokenws.ucws.nhso.go.th/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" name="UCWSTokenP1" targetNamespace="http://tokenws.ucws.nhso.go.th/" xmlns="http://schemas.xmlsoap.org/wsdl/">
  <types>
    <xsd:schema>
      <xsd:import schemaLocation="http://ucws.nhso.go.th:80/ucwstokenp1/UCWSTokenP1?xsd=1" namespace="http://tokenws.ucws.nhso.go.th/" />
    </xsd:schema>
  </types>
  <message name="searchCurrentByPID">
    <part name="parameters" element="tns:searchCurrentByPID" />
  </message>
  <message name="searchCurrentByPIDResponse">
    <part name="parameters" element="tns:searchCurrentByPIDResponse" />
  </message>
  <portType name="UCWSTokenP1">
    <operation name="searchCurrentByPID">
      <input wsam:Action="http://tokenws.ucws.nhso.go.th/UCWSTokenP1/searchCurrentByPIDRequest" message="tns:searchCurrentByPID" />
      <output wsam:Action="http://tokenws.ucws.nhso.go.th/UCWSTokenP1/searchCurrentByPIDResponse" message="tns:searchCurrentByPIDResponse" />
    </operation>
  </portType>
  <binding name="UCWSTokenP1PortBinding" type="tns:UCWSTokenP1">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <operation name="searchCurrentByPID">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
    </operation>
  </binding>
  <service name="UCWSTokenP1">
    <port name="UCWSTokenP1Port" binding="tns:UCWSTokenP1PortBinding">
      <soap:address location="http://ucws.nhso.go.th:80/ucwstokenp1/UCWSTokenP1" />
    </port>
  </service>
</definitions>